org/changes.org
#+TITLE: Cursed Changelog
#+AUTHOR: Sotla
#+LAST_EDIT: <2024-11-12 Tue 13:04 EST>
:setup:
#+SETUPFILE: setup-org-theme.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="death.css" />
#+HTML_HEAD: <meta content="Eclipse: Cursed Changelog" property="og:title" />
#+HTML_HEAD: <meta content="How did we fuck things up this time?" property="og:description" />
#+HTML_HEAD: <meta content="https://death.town/~corpse" property="og:url" />
#+HTML_HEAD: <meta content="https://death.town/~corpse/images/sotla.png" property="og:image" />
#+HTML_HEAD: <meta content="#FF0000" data-react-helmet="true" name="theme-color" />
#+OPTIONS: author:nil date:nil timestamp:nil num:nil toc:nil
:end:

*This is where we reflect on the terrible things we've done.*

This is not where we post our [[https://death.town/~corpse/war-journal.html][intrusive thoughts]].

[[file:index.html][TAKE ME BACK]]
* October 2024
** <2024-10-26 Sat>
*** "Mmm. Soup."
The first of cooking is implemented; making soup in a barebones manner.
How do I make it?
- Get a soup pot and at least one bowl.
- Fill the pot with four of any food-type things.
- For now, simply using the pot in your hand will 'cook' the soup. That will hopefully not be the case for long.
- Brilliant! You've made soup. It inherits a ll the nutritial value from its ingredients, is more hydrating, less poisonous and stretches further.
- Use a bowl on the pot to take a serving. Each serving contains one of each status value, positive or negative. The soup will stretch for as long as there are still status values left within.
** <2024-10-14 Mon>
Hey. Yes, you. Who the fuck do you /think/ I'm talking to?

You should look at the [[https://death.town/~corpse/controls.html][controls page]] again.
*** "Fucking finally! I've been starving to death! LITERALLY TO DEATH"
A revolutionary change -- ~KEY_Z~ can now be used to drop, throw, and place items in left hand.
Use it just like you use ~KEY_X~, it has the same interations as ~KEY_X~ does.

*** "It has pockets!"
You can now pocket items by holding ~KEY_Z~ or ~KEY_X~ respectively and then pressing ~KEY_1~ through ~KEY_4~. This does not show the item on your model.
** <2024-10-03 Thu>
*** "What a handy place to put my gun!"
You can now press ~KEY_H~ to Holster, and press it again with an empty hand to Unholster. This is our first foray into creating player inventories, which will be very important in the final game.

Observe the [[youtube:GliZChPuupg][development footage]].
*** "Probably shouldn't fuck with that guy."
Holstered items are now displayed on your character model for all to see.
*** "He's rotting, you know."
Rotting corpses emit horrible miasma.

Visual only for just now.
**** "CATCH!"
Things made of an element with the 'shatter' attribute break on hard impact. The entity they hit is hurt dependant on the thing's size.

Basically, you can throw glass bottles at people to kill them.
** <2024-10-01 Tue>
*** "They're blocking my screen!"
Added a variety of bottles and cans as THINGs.
*** "Oh god- he's dead!"
In fixing a bug that occured when a tumbled player disconnected we realized we could just kill the player the moment before they disconnect.

This resolves the bug and the immersion-ruining moment where someone abruptly vanishes. They just keel over and die.
*** "See what I have to say."
Speech bubbles now follow their point of origin, whether player or object. They also slowly rise above the player's head to displace them based on time.

You can see your own speech bubbles above your crosshair, backed in grey rather than black to distinguish them from others' words.
*** "I can't speak today."
Added text stuttering, like in Nightmare 3. Makes it harder to read some things, like the chatter of a broken radio.
*** "I won't misplace your novoluger again, I promise!"
Holding ~KEY_X~ now shows a ghost of where your held item would be placed if you used ~MOUSE_LEFT~. It's not the best right now, but it's late when we're writing this and we'll make it better tomorrow.
* September 2024
** <2024-09-30 Mon>
*** "Fu...sion-HAAA!"
You can now press ~KEY_C~ to combine the items in your primary and off hands.

For now, its primary uses are to consolidate stacking items, and to load magazines into guns without putting them on the floor.

In the future, you'll be able to use this to do simple crafting.
*** "My hands and my brain work together."
The name of the item you are holding is displayed in the appropriate bottom corner of the screen, left or right.
** <2024-09-29 Sun>
*** "That looks way less dumb."
Standing up from a fallen stance will play more appropriate, human animations.

For the undead we can continue to use the (faster) zombie animations for getting up, which were previously used for all characters.
*** "That looks WAY less dumb."
Just like from the old Alchemy demos, firearms now have tracers.

They look a bit cartoony and Grand Theft Auto 5-like but they're better than nothing, and especially important when bullets leave through the muzzle of your gun and not your eyes.
** <2024-09-24 Tue>
