org/changes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cursed Changelog</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="death.css" />
<meta content="Eclipse: Cursed Changelog" property="og:title" />
<meta content="How did we fuck things up this time?" property="og:description" />
<meta content="https://death.town/~corpse" property="og:url" />
<meta content="https://death.town/~corpse/images/sotla.png" property="og:image" />
<meta content="#FF0000" data-react-helmet="true" name="theme-color" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Cursed Changelog</h1>

<p>
<b>This is where we reflect on the terrible things we've done.</b>
</p>

<p>
This is not where we post our <a href="https://death.town/~corpse/war-journal.html">intrusive thoughts</a>.
</p>

<p>
<a href="index.html">TAKE ME BACK</a>
</p>
<div id="outline-container-orgd0076cc" class="outline-2">
<h2 id="orgd0076cc">October 2024</h2>
<div class="outline-text-2" id="text-orgd0076cc">
</div>
<div id="outline-container-org23ebf4c" class="outline-3">
<h3 id="org23ebf4c"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-10-26 Sat&gt;</span></span></h3>
<div class="outline-text-3" id="text-org23ebf4c">
</div>
<div id="outline-container-org5b11d0f" class="outline-4">
<h4 id="org5b11d0f">"Mmm. Soup."</h4>
<div class="outline-text-4" id="text-org5b11d0f">
<p>
The first of cooking is implemented; making soup in a barebones manner.
How do I make it?
</p>
<ul class="org-ul">
<li>Get a soup pot and at least one bowl.</li>
<li>Fill the pot with four of any food-type things.</li>
<li>For now, simply using the pot in your hand will 'cook' the soup. That will hopefully not be the case for long.</li>
<li>Brilliant! You've made soup. It inherits a ll the nutritial value from its ingredients, is more hydrating, less poisonous and stretches further.</li>
<li>Use a bowl on the pot to take a serving. Each serving contains one of each status value, positive or negative. The soup will stretch for as long as there are still status values left within.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9858c1c" class="outline-3">
<h3 id="org9858c1c"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-10-14 Mon&gt;</span></span></h3>
<div class="outline-text-3" id="text-org9858c1c">
<p>
Hey. Yes, you. Who the fuck do you <i>think</i> I'm talking to?
</p>

<p>
You should look at the <a href="https://death.town/~corpse/controls.html">controls page</a> again.
</p>
</div>
<div id="outline-container-org5280819" class="outline-4">
<h4 id="org5280819">"Fucking finally! I've been starving to death! LITERALLY TO DEATH"</h4>
<div class="outline-text-4" id="text-org5280819">
<p>
A revolutionary change &#x2013; <code>KEY_Z</code> can now be used to drop, throw, and place items in left hand.
Use it just like you use <code>KEY_X</code>, it has the same interations as <code>KEY_X</code> does.
</p>
</div>
</div>

<div id="outline-container-org5693d27" class="outline-4">
<h4 id="org5693d27">"It has pockets!"</h4>
<div class="outline-text-4" id="text-org5693d27">
<p>
You can now pocket items by holding <code>KEY_Z</code> or <code>KEY_X</code> respectively and then pressing <code>KEY_1</code> through <code>KEY_4</code>. This does not show the item on your model.
</p>
</div>
</div>
</div>
<div id="outline-container-org5340ae3" class="outline-3">
<h3 id="org5340ae3"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-10-03 Thu&gt;</span></span></h3>
<div class="outline-text-3" id="text-org5340ae3">
</div>
<div id="outline-container-orgd71e467" class="outline-4">
<h4 id="orgd71e467">"What a handy place to put my gun!"</h4>
<div class="outline-text-4" id="text-orgd71e467">
<p>
You can now press <code>KEY_H</code> to Holster, and press it again with an empty hand to Unholster. This is our first foray into creating player inventories, which will be very important in the final game.
</p>

<p>
Observe the <a href="https://www.youtube.com/watch?v=GliZChPuupg">development footage</a>.
</p>
</div>
</div>
<div id="outline-container-org6ad04da" class="outline-4">
<h4 id="org6ad04da">"Probably shouldn't fuck with that guy."</h4>
<div class="outline-text-4" id="text-org6ad04da">
<p>
Holstered items are now displayed on your character model for all to see.
</p>
</div>
</div>
<div id="outline-container-org2194899" class="outline-4">
<h4 id="org2194899">"He's rotting, you know."</h4>
<div class="outline-text-4" id="text-org2194899">
<p>
Rotting corpses emit horrible miasma.
</p>

<p>
Visual only for just now.
</p>
</div>
<ul class="org-ul">
<li><a id="orgb0677e0"></a>"CATCH!"<br />
<div class="outline-text-5" id="text-orgb0677e0">
<p>
Things made of an element with the 'shatter' attribute break on hard impact. The entity they hit is hurt dependant on the thing's size.
</p>

<p>
Basically, you can throw glass bottles at people to kill them.
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1f631c" class="outline-3">
<h3 id="orgc1f631c"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-10-01 Tue&gt;</span></span></h3>
<div class="outline-text-3" id="text-orgc1f631c">
</div>
<div id="outline-container-orge974aba" class="outline-4">
<h4 id="orge974aba">"They're blocking my screen!"</h4>
<div class="outline-text-4" id="text-orge974aba">
<p>
Added a variety of bottles and cans as THINGs.
</p>
</div>
</div>
<div id="outline-container-org1895459" class="outline-4">
<h4 id="org1895459">"Oh god- he's dead!"</h4>
<div class="outline-text-4" id="text-org1895459">
<p>
In fixing a bug that occured when a tumbled player disconnected we realized we could just kill the player the moment before they disconnect.
</p>

<p>
This resolves the bug and the immersion-ruining moment where someone abruptly vanishes. They just keel over and die.
</p>
</div>
</div>
<div id="outline-container-org6d983a5" class="outline-4">
<h4 id="org6d983a5">"See what I have to say."</h4>
<div class="outline-text-4" id="text-org6d983a5">
<p>
Speech bubbles now follow their point of origin, whether player or object. They also slowly rise above the player's head to displace them based on time.
</p>

<p>
You can see your own speech bubbles above your crosshair, backed in grey rather than black to distinguish them from others' words.
</p>
</div>
</div>
<div id="outline-container-org95bf77d" class="outline-4">
<h4 id="org95bf77d">"I can't speak today."</h4>
<div class="outline-text-4" id="text-org95bf77d">
<p>
Added text stuttering, like in Nightmare 3. Makes it harder to read some things, like the chatter of a broken radio.
</p>
</div>
</div>
<div id="outline-container-org34b2761" class="outline-4">
<h4 id="org34b2761">"I won't misplace your novoluger again, I promise!"</h4>
<div class="outline-text-4" id="text-org34b2761">
<p>
Holding <code>KEY_X</code> now shows a ghost of where your held item would be placed if you used <code>MOUSE_LEFT</code>. It's not the best right now, but it's late when we're writing this and we'll make it better tomorrow.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org87a888e" class="outline-2">
<h2 id="org87a888e">September 2024</h2>
<div class="outline-text-2" id="text-org87a888e">
</div>
<div id="outline-container-orge31b1e4" class="outline-3">
<h3 id="orge31b1e4"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-30 Mon&gt;</span></span></h3>
<div class="outline-text-3" id="text-orge31b1e4">
</div>
<div id="outline-container-org405ee80" class="outline-4">
<h4 id="org405ee80">"Fu&#x2026;sion-HAAA!"</h4>
<div class="outline-text-4" id="text-org405ee80">
<p>
You can now press <code>KEY_C</code> to combine the items in your primary and off hands.
</p>

<p>
For now, its primary uses are to consolidate stacking items, and to load magazines into guns without putting them on the floor.
</p>

<p>
In the future, you'll be able to use this to do simple crafting.
</p>
</div>
</div>
<div id="outline-container-orgeeb89c8" class="outline-4">
<h4 id="orgeeb89c8">"My hands and my brain work together."</h4>
<div class="outline-text-4" id="text-orgeeb89c8">
<p>
The name of the item you are holding is displayed in the appropriate bottom corner of the screen, left or right.
</p>
</div>
</div>
</div>
<div id="outline-container-org10a24d3" class="outline-3">
<h3 id="org10a24d3"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-29 Sun&gt;</span></span></h3>
<div class="outline-text-3" id="text-org10a24d3">
</div>
<div id="outline-container-orgb33bb69" class="outline-4">
<h4 id="orgb33bb69">"That looks way less dumb."</h4>
<div class="outline-text-4" id="text-orgb33bb69">
<p>
Standing up from a fallen stance will play more appropriate, human animations.
</p>

<p>
For the undead we can continue to use the (faster) zombie animations for getting up, which were previously used for all characters.
</p>
</div>
</div>
<div id="outline-container-org5ade0e4" class="outline-4">
<h4 id="org5ade0e4">"That looks WAY less dumb."</h4>
<div class="outline-text-4" id="text-org5ade0e4">
<p>
Just like from the old Alchemy demos, firearms now have tracers.
</p>

<p>
They look a bit cartoony and Grand Theft Auto 5-like but they're better than nothing, and especially important when bullets leave through the muzzle of your gun and not your eyes.
</p>
</div>
</div>
</div>
