org/changes.org
*** "Sounds fine to me."
Things can have their impact and attack sounds set automatically dependant on both element, then size.

This will save time in future and make things made of elements sound fitting.

For example, a wooden bat will sound wooden and a metal bat will sound metal. So interesting.
*** "Wow, I can look at them!"
Basic TargetID functionality from Alchemy was ported back into Eclipse.

See it [[youtube:fVurAtv5ppw][here]].
*** "Ooh, pretty."
Objects nearer to your crosshair will be highlighted with a color-cycling halo.

This, and a more forgiving 'range' to detect objects with, should make it easier to interact with the world.
*** "Don't shoot! I have bones!"
Guns can finally shoot real bullets instead of pretend ones; For the time being, they only do 10 damage, but later we'll be able to change damage depending on the gun and caliber.

Unlike some other games, these guns fire from the muzzle rather than your character's eyes.
*** "Uh oh, my hands are full."
Switching items between hands is now significantly improved. Before, an item occupying one hand would block an item in another hand from changing which hand it was held in; This was fixed terribly by moving the blocking item into the world for 0.1 seconds while the transfer was made. Now, items actually swap between the two hands simultaneously, with no blocking.
*** "You load 15 rounds, and what do you get?"
Guns now have magazines, which are loaded by using ~MOUSE_LEFT~ on them while holding an ammo box (Currently, this can only be done one bullet at a time). The magazine can then be loaded into a gun with the same maneuver.

You can also remove a magazine from a gun by holding ~MOUSE_RIGHT~ and pressing ~KEY_R~ with a gun in your primary hand.

In the future, you will be able to do all of this in your hands without dropping anything in the world.
*** "Lay that pistol down."
Guns fire if they impact surfaces too hard; At some point we'll add recoil so they bounce around after they fire, and make it so they don't hop around and dump their whole mag in the process.
** <2024-09-19 Thu>
*** "Liver Failure Forever!"
Radios were added that occasionally bark out the Kommandant's great achievements and citizen reminders.

*** "This sucks."
Every thing now has a durability, affected by the element it's made of.

Flamable elements (currently only wood) ignite when taking burn damage, with the chance and intensity depending on the element's flamability.
** <2024-09-17 Tue>
*** "Now I don't look as stupid as I really am."
You can no longer turn with the mouse if you are performing an immobilizing act.

This includes shoving, kicking, and standing up.
** <2024-09-16 Mon>
*** "Things made of +Stuff+ Elements!"
Things can now be made of various materials, which we are calling elements.

For example, a crowbar could be made of flimsy copper, reinforced steel or brittle wood.

The element a thing is made from affects:
- Sharp damage
- Blunt damage
- Swing delay
- Throw distance
- Texture applied
- Colour applied
- Durability (currently unused)
- Flamability (currently unused)

There's no way to set these currently besides our magic wand, but this will allow for greater mechanical depth.
Elements have attributes to allow things to decide what elements they can be made of. This is not for practicality, but believability - you can make a sledgehammer out of glass if you /really/ want to, but you cannot make a table out of leather.
Thanks to yuescript's OOP new elements are incredibly easy to create.
*** "That was there the whole time?"
An issue with how we were predicting animation sequences caused things to look /wrong/ for the player's perception of themselves.

Thankfully the simple fix to this problem is applicable everywhere it appears in the game.
*** "Oh no! AI is invading my favorite game!"
Bots were given basic functionality. Their behavioral thought sequence is described below.

- If I do not have a target, locate one.
  - Seek a weapon first. It must not be too far away and visible to me.
  - If I cannot find a weapon, seek a person. They will become my friend.
- If I found a target, approach it.
  - If my target is an acceptable weapon, pick it up when I can reach it.
  - If my target is my friend, follow and maintain a respectful distance.
  - If my target is my enemy, prepare for attack and close in.
- I trust my friends.
  - If my target is my friend, I feel safe enough to try locating a weapon during the peace.
- I will destroy my enemies.
  - When my enemies die, I will lose my opinion of them. We may become friends again.
  - I will use my weapon if I have one. If I don't, I will sometimes shove my enemy.
- Anyone who hurts me is my enemy.

Whether or not this will be utilized for any purpose constructive for the end user's gameplay, or remain a curiosity of development/debugging features, remains a mystery.
** <2024-09-15 Sun>
*** "Makes more sense like this."
Like in +Extreme Football Throwdown+ Fucked Up Football, shoving/kicking/melee attacks can strike more than one target if they're close enough together. More importantly, melee weapons no longer /only/ hit precisely where your crosshair happens to be; this makes hit detection more forgiving in a manner that helps the game rather than make it 'too easy'.

Punching still only hits one target at a time.
*** "Finally, now I realize."
The old speed meter from Alchemy was ported.

Now you can see what your desired target speed is, in comparison to your real speed.
*** "Look at this corpse I found."
Holding a body will display you as holding both arms out to grab it with.
*** "It took long enough."
When you are done standing up, you will now become unstuck if your body would have you get up in a position where you would be trapped in level geometry.
