org/changes.html
<div id="outline-container-org1ada7af" class="outline-3">
<h3 id="org1ada7af"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-24 Tue&gt;</span></span></h3>
<div class="outline-text-3" id="text-org1ada7af">
</div>
<div id="outline-container-org1622922" class="outline-4">
<h4 id="org1622922">"Sounds fine to me."</h4>
<div class="outline-text-4" id="text-org1622922">
<p>
Things can have their impact and attack sounds set automatically dependant on both element, then size.
</p>

<p>
This will save time in future and make things made of elements sound fitting.
</p>

<p>
For example, a wooden bat will sound wooden and a metal bat will sound metal. So interesting.
</p>
</div>
</div>
<div id="outline-container-orge609e5f" class="outline-4">
<h4 id="orge609e5f">"Wow, I can look at them!"</h4>
<div class="outline-text-4" id="text-orge609e5f">
<p>
Basic TargetID functionality from Alchemy was ported back into Eclipse.
</p>

<p>
See it <a href="https://www.youtube.com/watch?v=fVurAtv5ppw">here</a>.
</p>
</div>
</div>
<div id="outline-container-org9a135f5" class="outline-4">
<h4 id="org9a135f5">"Ooh, pretty."</h4>
<div class="outline-text-4" id="text-org9a135f5">
<p>
Objects nearer to your crosshair will be highlighted with a color-cycling halo.
</p>

<p>
This, and a more forgiving 'range' to detect objects with, should make it easier to interact with the world.
</p>
</div>
</div>
<div id="outline-container-orgca841a1" class="outline-4">
<h4 id="orgca841a1">"Don't shoot! I have bones!"</h4>
<div class="outline-text-4" id="text-orgca841a1">
<p>
Guns can finally shoot real bullets instead of pretend ones; For the time being, they only do 10 damage, but later we'll be able to change damage depending on the gun and caliber.
</p>

<p>
Unlike some other games, these guns fire from the muzzle rather than your character's eyes.
</p>
</div>
</div>
<div id="outline-container-org407c9ed" class="outline-4">
<h4 id="org407c9ed">"Uh oh, my hands are full."</h4>
<div class="outline-text-4" id="text-org407c9ed">
<p>
Switching items between hands is now significantly improved. Before, an item occupying one hand would block an item in another hand from changing which hand it was held in; This was fixed terribly by moving the blocking item into the world for 0.1 seconds while the transfer was made. Now, items actually swap between the two hands simultaneously, with no blocking.
</p>
</div>
</div>
<div id="outline-container-org0ba563e" class="outline-4">
<h4 id="org0ba563e">"You load 15 rounds, and what do you get?"</h4>
<div class="outline-text-4" id="text-org0ba563e">
<p>
Guns now have magazines, which are loaded by using <code>MOUSE_LEFT</code> on them while holding an ammo box (Currently, this can only be done one bullet at a time). The magazine can then be loaded into a gun with the same maneuver.
</p>

<p>
You can also remove a magazine from a gun by holding <code>MOUSE_RIGHT</code> and pressing <code>KEY_R</code> with a gun in your primary hand.
</p>

<p>
In the future, you will be able to do all of this in your hands without dropping anything in the world.
</p>
</div>
</div>
<div id="outline-container-org8ebb376" class="outline-4">
<h4 id="org8ebb376">"Lay that pistol down."</h4>
<div class="outline-text-4" id="text-org8ebb376">
<p>
Guns fire if they impact surfaces too hard; At some point we'll add recoil so they bounce around after they fire, and make it so they don't hop around and dump their whole mag in the process.
</p>
</div>
</div>
</div>
<div id="outline-container-org52a85ef" class="outline-3">
<h3 id="org52a85ef"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-19 Thu&gt;</span></span></h3>
<div class="outline-text-3" id="text-org52a85ef">
</div>
<div id="outline-container-org85194ac" class="outline-4">
<h4 id="org85194ac">"Liver Failure Forever!"</h4>
<div class="outline-text-4" id="text-org85194ac">
<p>
Radios were added that occasionally bark out the Kommandant's great achievements and citizen reminders.
</p>
</div>
</div>

<div id="outline-container-orge418491" class="outline-4">
<h4 id="orge418491">"This sucks."</h4>
<div class="outline-text-4" id="text-orge418491">
<p>
Every thing now has a durability, affected by the element it's made of.
</p>

<p>
Flamable elements (currently only wood) ignite when taking burn damage, with the chance and intensity depending on the element's flamability.
</p>
</div>
</div>
</div>
<div id="outline-container-org1cc7a24" class="outline-3">
<h3 id="org1cc7a24"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-17 Tue&gt;</span></span></h3>
<div class="outline-text-3" id="text-org1cc7a24">
</div>
<div id="outline-container-orgf34416e" class="outline-4">
<h4 id="orgf34416e">"Now I don't look as stupid as I really am."</h4>
<div class="outline-text-4" id="text-orgf34416e">
<p>
You can no longer turn with the mouse if you are performing an immobilizing act.
</p>

<p>
This includes shoving, kicking, and standing up.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf299d33" class="outline-3">
<h3 id="orgf299d33"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-16 Mon&gt;</span></span></h3>
<div class="outline-text-3" id="text-orgf299d33">
</div>
<div id="outline-container-orgaef8a10" class="outline-4">
<h4 id="orgaef8a10">"Things made of <del>Stuff</del> Elements!"</h4>
<div class="outline-text-4" id="text-orgaef8a10">
<p>
Things can now be made of various materials, which we are calling elements.
</p>

<p>
For example, a crowbar could be made of flimsy copper, reinforced steel or brittle wood.
</p>

<p>
The element a thing is made from affects:
</p>
<ul class="org-ul">
<li>Sharp damage</li>
<li>Blunt damage</li>
<li>Swing delay</li>
<li>Throw distance</li>
<li>Texture applied</li>
<li>Colour applied</li>
<li>Durability (currently unused)</li>
<li>Flamability (currently unused)</li>
</ul>

<p>
There's no way to set these currently besides our magic wand, but this will allow for greater mechanical depth.
Elements have attributes to allow things to decide what elements they can be made of. This is not for practicality, but believability - you can make a sledgehammer out of glass if you <i>really</i> want to, but you cannot make a table out of leather.
Thanks to yuescript's OOP new elements are incredibly easy to create.
</p>
</div>
</div>
<div id="outline-container-orgc98f612" class="outline-4">
<h4 id="orgc98f612">"That was there the whole time?"</h4>
<div class="outline-text-4" id="text-orgc98f612">
<p>
An issue with how we were predicting animation sequences caused things to look <i>wrong</i> for the player's perception of themselves.
</p>

<p>
Thankfully the simple fix to this problem is applicable everywhere it appears in the game.
</p>
</div>
</div>
<div id="outline-container-org524c5d3" class="outline-4">
<h4 id="org524c5d3">"Oh no! AI is invading my favorite game!"</h4>
<div class="outline-text-4" id="text-org524c5d3">
<p>
Bots were given basic functionality. Their behavioral thought sequence is described below.
</p>

<ul class="org-ul">
<li>If I do not have a target, locate one.
<ul class="org-ul">
<li>Seek a weapon first. It must not be too far away and visible to me.</li>
<li>If I cannot find a weapon, seek a person. They will become my friend.</li>
</ul></li>
<li>If I found a target, approach it.
<ul class="org-ul">
<li>If my target is an acceptable weapon, pick it up when I can reach it.</li>
<li>If my target is my friend, follow and maintain a respectful distance.</li>
<li>If my target is my enemy, prepare for attack and close in.</li>
</ul></li>
<li>I trust my friends.
<ul class="org-ul">
<li>If my target is my friend, I feel safe enough to try locating a weapon during the peace.</li>
</ul></li>
<li>I will destroy my enemies.
<ul class="org-ul">
<li>When my enemies die, I will lose my opinion of them. We may become friends again.</li>
<li>I will use my weapon if I have one. If I don't, I will sometimes shove my enemy.</li>
</ul></li>
<li>Anyone who hurts me is my enemy.</li>
</ul>

<p>
Whether or not this will be utilized for any purpose constructive for the end user's gameplay, or remain a curiosity of development/debugging features, remains a mystery.
</p>
</div>
</div>
</div>
<div id="outline-container-org57c24f5" class="outline-3">
<h3 id="org57c24f5"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-15 Sun&gt;</span></span></h3>
<div class="outline-text-3" id="text-org57c24f5">
</div>
<div id="outline-container-org7714639" class="outline-4">
<h4 id="org7714639">"Makes more sense like this."</h4>
<div class="outline-text-4" id="text-org7714639">
<p>
Like in <del>Extreme Football Throwdown</del> Fucked Up Football, shoving/kicking/melee attacks can strike more than one target if they're close enough together. More importantly, melee weapons no longer <i>only</i> hit precisely where your crosshair happens to be; this makes hit detection more forgiving in a manner that helps the game rather than make it 'too easy'.
</p>

<p>
Punching still only hits one target at a time.
</p>
</div>
</div>
<div id="outline-container-orgc28e3b2" class="outline-4">
<h4 id="orgc28e3b2">"Finally, now I realize."</h4>
<div class="outline-text-4" id="text-orgc28e3b2">
<p>
The old speed meter from Alchemy was ported.
</p>

<p>
Now you can see what your desired target speed is, in comparison to your real speed.
</p>
</div>
</div>
<div id="outline-container-org2deb937" class="outline-4">
<h4 id="org2deb937">"Look at this corpse I found."</h4>
<div class="outline-text-4" id="text-org2deb937">
<p>
Holding a body will display you as holding both arms out to grab it with.
</p>
</div>
</div>
<div id="outline-container-orgac946f7" class="outline-4">
<h4 id="orgac946f7">"It took long enough."</h4>
<div class="outline-text-4" id="text-orgac946f7">
<p>
When you are done standing up, you will now become unstuck if your body would have you get up in a position where you would be trapped in level geometry.
</p>
</div>
</div>
