org/changes.org
*** "Yay, my immersion!"
Colors are now preserved for player bodygroups (i.e. lenses of goggles/glasses) between standing and ragdolled players.
*** "Watch your clearance."
You can no longer rise from crouching/proning (either to a risen state or proning-to-crouching) if there is not enough space for you to do so, which prevents you from getting stuck in map geometry.
*** "Gimme a damn second!"
Standing up from a fallen state now immobilizes you for the length of an animation that plays when you get up.

The animation that plays depends on the direction your body is facing; it takes longer to get up if you're lying on your front.

You can also not get up if your body is in motion. This effectively prevents the 'flying' exploit.
** <2024-09-14 Sat>
*** Bugfixes
Several of the little bastards were eliminated.
- Rendering of bodies was handled weirdly; the rest of the body other than the head/hands appeared rendered 'on top' of everything else.
- Death by high-speed impact with people or a wall would produce a mostly-invisible body.
- Some ~ACT~ events were playing their animation twice.
** <2024-09-12 Thu>
*** "Behold! The ROT!"
Behold works on bodies.

You can observe if they're alive or not.

It also tells you how horribly rotten it is.
*** "Good thing I can't read."
A new section was added to the home page at ~death.town/~corpse~ to refer to the game's control scheme.
*** "SORRY I FORGOT CAPS LOCK WAS ON"
Toggling caps lock in the chatter is functional again.
*** "I can't hear you from all the way down there."
Speech was broken while one was ragdolled. Now it isn't.
*** "Wanna see me run myself to death? Wanna see me do it again?"
Animations for different speeds of movement were fixed.

In addition, a separate animation exists for sprinting (as opposed to simply a light run).
*** "Fucking put me down NOW!"
You can now pick up and move bodies around if your hands are empty.

Simply left click on them, like you would do to pick up things.
*** "WHAM! CRASH!"
The bug where doors could fly off into space from being kicked, punched, or shoved was fixed.

After that the functionality for kicking doors open was re-implemented from Alchemy.
*** "Fresh meat!"
- Corpses can be butchered using any sharp weapon.
- Meat and bone can be harvested with a sharp attack.
- The results can be /ruined/.
  - Ruined products are less useful.
  - Currently based on a random chance.
  - Later on, success will be determined by skill.
- Butchery's returns depend on the state of the corpse.
  - Rotten corpses produce rotten meat.
  - Cremated bodies produce char.
  - Skeletons crumble into bones and disappear forever.
*** "BEHOLD!"
Press ~KEY_B~ to BEHOLD.

This lets you check what a thing is and whether or not a body is living.
*** "Wow, I can hold it in my second hand and drop it!"
Press ~KEY_R~ to swap items between your hands.

Probably in the future you would need to hold ~ALT~ when you press ~KEY_R~ to do this.

This feature is not meaningfully implemented for anything yet, but required for loading of firearms.

Attempting to drop items with something in your offhand but nothing in your primary hand will drop it from your offhand.
** <2024-09-11 Wed>
*** "Made you look."
~death.town/~corpse~ now displays the /Spleen/ font.
*** "You've met with a terrible fate, haven't you?"
~CASTE~ and ~FATE~ were created.

A ~CASTE~ represents a category of society; a ~FATE~ represents a class within that category.

The existing castes and fates are as follows:
- Scum
  - Laborer
  - Keeper
  - Stitcher
  - Psycher
  - Deadbeat
  - Foreman
  - Cook
- Sanitar Squad
  - Sanitar Scrub
  - Sanitar Sentry
  - Sanitar Savior
  - Sanitar Seeker
  - Sanitar Superior
- Overlords
  - Sekretar
  - Adjutant
  - Kommandant
*** "Hey everyone, look at me! I'm special!"
In the future, items will be what define your appearance. For now, however, they are set when you spawn as a particular fate like the old game.

So far the Kommandant and all of the Sanitars have defined appearances.
** <2024-09-09 Mon>
*** "This is the most uncomfortable chatbox I've ever used."
The ancient 'bubble' oriented system of character speech has been restored.

Conversation items that construct a timeline up-to-down in a corner of the screen for following who said what will come next.
*** Music
Like the old game, this one now plays music in the background.

In addition to the song name appearing in the console, the song's artist is written too.
*** ~FONT~
A MoonScript class now exists for definition of custom fonts.

Custom fonts on Garry's Mod are very strange on Linux; I was worried I might not figure it out, but it /should/ be functional on all systems.
*** ~EFFECT~
A MoonScript class now exists for definition of scripted effects.

Hopefully this will make it much easier for us to create custom particles and put them in all sorts of places.
** <2024-09-06 Fri>
*** /THE NEXT TEST/ - <2024-09-13 Fri>
By this time, we hope to have a unique mechanism for character speech, and firearms.
*** First deadline
Today a successful technological demonstration of Eclipse was held.

In that time, the remainder of our deadlined items were completed -- all of the features we wanted to implement were implemented and all of the bugs we were tracking were eliminated.
