org/changes.html
<div id="outline-container-orgd1b0063" class="outline-4">
<h4 id="orgd1b0063">"Yay, my immersion!"</h4>
<div class="outline-text-4" id="text-orgd1b0063">
<p>
Colors are now preserved for player bodygroups (i.e. lenses of goggles/glasses) between standing and ragdolled players.
</p>
</div>
</div>
<div id="outline-container-org4e11ae7" class="outline-4">
<h4 id="org4e11ae7">"Watch your clearance."</h4>
<div class="outline-text-4" id="text-org4e11ae7">
<p>
You can no longer rise from crouching/proning (either to a risen state or proning-to-crouching) if there is not enough space for you to do so, which prevents you from getting stuck in map geometry.
</p>
</div>
</div>
<div id="outline-container-org6feda46" class="outline-4">
<h4 id="org6feda46">"Gimme a damn second!"</h4>
<div class="outline-text-4" id="text-org6feda46">
<p>
Standing up from a fallen state now immobilizes you for the length of an animation that plays when you get up.
</p>

<p>
The animation that plays depends on the direction your body is facing; it takes longer to get up if you're lying on your front.
</p>

<p>
You can also not get up if your body is in motion. This effectively prevents the 'flying' exploit.
</p>
</div>
</div>
</div>
<div id="outline-container-org4bce9b4" class="outline-3">
<h3 id="org4bce9b4"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-14 Sat&gt;</span></span></h3>
<div class="outline-text-3" id="text-org4bce9b4">
</div>
<div id="outline-container-org303e8ff" class="outline-4">
<h4 id="org303e8ff">Bugfixes</h4>
<div class="outline-text-4" id="text-org303e8ff">
<p>
Several of the little bastards were eliminated.
</p>
<ul class="org-ul">
<li>Rendering of bodies was handled weirdly; the rest of the body other than the head/hands appeared rendered 'on top' of everything else.</li>
<li>Death by high-speed impact with people or a wall would produce a mostly-invisible body.</li>
<li>Some <code>ACT</code> events were playing their animation twice.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7ccf818" class="outline-3">
<h3 id="org7ccf818"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-12 Thu&gt;</span></span></h3>
<div class="outline-text-3" id="text-org7ccf818">
</div>
<div id="outline-container-org9906a9a" class="outline-4">
<h4 id="org9906a9a">"Behold! The ROT!"</h4>
<div class="outline-text-4" id="text-org9906a9a">
<p>
Behold works on bodies.
</p>

<p>
You can observe if they're alive or not.
</p>

<p>
It also tells you how horribly rotten it is.
</p>
</div>
</div>
<div id="outline-container-org64e0009" class="outline-4">
<h4 id="org64e0009">"Good thing I can't read."</h4>
<div class="outline-text-4" id="text-org64e0009">
<p>
A new section was added to the home page at <code>death.town/~corpse</code> to refer to the game's control scheme.
</p>
</div>
</div>
<div id="outline-container-org6b1ec80" class="outline-4">
<h4 id="org6b1ec80">"SORRY I FORGOT CAPS LOCK WAS ON"</h4>
<div class="outline-text-4" id="text-org6b1ec80">
<p>
Toggling caps lock in the chatter is functional again.
</p>
</div>
</div>
<div id="outline-container-orgd24b8e8" class="outline-4">
<h4 id="orgd24b8e8">"I can't hear you from all the way down there."</h4>
<div class="outline-text-4" id="text-orgd24b8e8">
<p>
Speech was broken while one was ragdolled. Now it isn't.
</p>
</div>
</div>
<div id="outline-container-org78ac706" class="outline-4">
<h4 id="org78ac706">"Wanna see me run myself to death? Wanna see me do it again?"</h4>
<div class="outline-text-4" id="text-org78ac706">
<p>
Animations for different speeds of movement were fixed.
</p>

<p>
In addition, a separate animation exists for sprinting (as opposed to simply a light run).
</p>
</div>
</div>
<div id="outline-container-orgdc8bc66" class="outline-4">
<h4 id="orgdc8bc66">"Fucking put me down NOW!"</h4>
<div class="outline-text-4" id="text-orgdc8bc66">
<p>
You can now pick up and move bodies around if your hands are empty.
</p>

<p>
Simply left click on them, like you would do to pick up things.
</p>
</div>
</div>
<div id="outline-container-org3f5ac7a" class="outline-4">
<h4 id="org3f5ac7a">"WHAM! CRASH!"</h4>
<div class="outline-text-4" id="text-org3f5ac7a">
<p>
The bug where doors could fly off into space from being kicked, punched, or shoved was fixed.
</p>

<p>
After that the functionality for kicking doors open was re-implemented from Alchemy.
</p>
</div>
</div>
<div id="outline-container-orgad3bb94" class="outline-4">
<h4 id="orgad3bb94">"Fresh meat!"</h4>
<div class="outline-text-4" id="text-orgad3bb94">
<ul class="org-ul">
<li>Corpses can be butchered using any sharp weapon.</li>
<li>Meat and bone can be harvested with a sharp attack.</li>
<li>The results can be <i>ruined</i>.
<ul class="org-ul">
<li>Ruined products are less useful.</li>
<li>Currently based on a random chance.</li>
<li>Later on, success will be determined by skill.</li>
</ul></li>
<li>Butchery's returns depend on the state of the corpse.
<ul class="org-ul">
<li>Rotten corpses produce rotten meat.</li>
<li>Cremated bodies produce char.</li>
<li>Skeletons crumble into bones and disappear forever.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9928cd1" class="outline-4">
<h4 id="org9928cd1">"BEHOLD!"</h4>
<div class="outline-text-4" id="text-org9928cd1">
<p>
Press <code>KEY_B</code> to BEHOLD.
</p>

<p>
This lets you check what a thing is and whether or not a body is living.
</p>
</div>
</div>
<div id="outline-container-orgd4d7cd5" class="outline-4">
<h4 id="orgd4d7cd5">"Wow, I can hold it in my second hand and drop it!"</h4>
<div class="outline-text-4" id="text-orgd4d7cd5">
<p>
Press <code>KEY_R</code> to swap items between your hands.
</p>

<p>
Probably in the future you would need to hold <code>ALT</code> when you press <code>KEY_R</code> to do this.
</p>

<p>
This feature is not meaningfully implemented for anything yet, but required for loading of firearms.
</p>

<p>
Attempting to drop items with something in your offhand but nothing in your primary hand will drop it from your offhand.
</p>
</div>
</div>
</div>
<div id="outline-container-org11bae39" class="outline-3">
<h3 id="org11bae39"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-11 Wed&gt;</span></span></h3>
<div class="outline-text-3" id="text-org11bae39">
</div>
<div id="outline-container-orgd6f1938" class="outline-4">
<h4 id="orgd6f1938">"Made you look."</h4>
<div class="outline-text-4" id="text-orgd6f1938">
<p>
<code>death.town/~corpse</code> now displays the <i>Spleen</i> font.
</p>
</div>
</div>
<div id="outline-container-orgfd4b5f0" class="outline-4">
<h4 id="orgfd4b5f0">"You've met with a terrible fate, haven't you?"</h4>
<div class="outline-text-4" id="text-orgfd4b5f0">
<p>
<code>CASTE</code> and <code>FATE</code> were created.
</p>

<p>
A <code>CASTE</code> represents a category of society; a <code>FATE</code> represents a class within that category.
</p>

<p>
The existing castes and fates are as follows:
</p>
<ul class="org-ul">
<li>Scum
<ul class="org-ul">
<li>Laborer</li>
<li>Keeper</li>
<li>Stitcher</li>
<li>Psycher</li>
<li>Deadbeat</li>
<li>Foreman</li>
<li>Cook</li>
</ul></li>
<li>Sanitar Squad
<ul class="org-ul">
<li>Sanitar Scrub</li>
<li>Sanitar Sentry</li>
<li>Sanitar Savior</li>
<li>Sanitar Seeker</li>
<li>Sanitar Superior</li>
</ul></li>
<li>Overlords
<ul class="org-ul">
<li>Sekretar</li>
<li>Adjutant</li>
<li>Kommandant</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbc08712" class="outline-4">
<h4 id="orgbc08712">"Hey everyone, look at me! I'm special!"</h4>
<div class="outline-text-4" id="text-orgbc08712">
<p>
In the future, items will be what define your appearance. For now, however, they are set when you spawn as a particular fate like the old game.
</p>

<p>
So far the Kommandant and all of the Sanitars have defined appearances.
</p>
</div>
</div>
</div>
<div id="outline-container-org11e1851" class="outline-3">
<h3 id="org11e1851"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-09 Mon&gt;</span></span></h3>
<div class="outline-text-3" id="text-org11e1851">
</div>
<div id="outline-container-org64aa45f" class="outline-4">
<h4 id="org64aa45f">"This is the most uncomfortable chatbox I've ever used."</h4>
<div class="outline-text-4" id="text-org64aa45f">
<p>
The ancient 'bubble' oriented system of character speech has been restored.
</p>

<p>
Conversation items that construct a timeline up-to-down in a corner of the screen for following who said what will come next.
</p>
</div>
</div>
<div id="outline-container-org3132c23" class="outline-4">
<h4 id="org3132c23">Music</h4>
<div class="outline-text-4" id="text-org3132c23">
<p>
Like the old game, this one now plays music in the background.
</p>

<p>
In addition to the song name appearing in the console, the song's artist is written too.
</p>
</div>
</div>
<div id="outline-container-org4b1ad07" class="outline-4">
<h4 id="org4b1ad07"><code>FONT</code></h4>
<div class="outline-text-4" id="text-org4b1ad07">
<p>
A MoonScript class now exists for definition of custom fonts.
</p>

<p>
Custom fonts on Garry's Mod are very strange on Linux; I was worried I might not figure it out, but it <i>should</i> be functional on all systems.
</p>
</div>
</div>
<div id="outline-container-org64e56ef" class="outline-4">
<h4 id="org64e56ef"><code>EFFECT</code></h4>
<div class="outline-text-4" id="text-org64e56ef">
<p>
A MoonScript class now exists for definition of scripted effects.
</p>

<p>
Hopefully this will make it much easier for us to create custom particles and put them in all sorts of places.
</p>
</div>
</div>
</div>
<div id="outline-container-org97e9843" class="outline-3">
<h3 id="org97e9843"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-06 Fri&gt;</span></span></h3>
<div class="outline-text-3" id="text-org97e9843">
</div>
<div id="outline-container-org362394d" class="outline-4">
<h4 id="org362394d"><i>THE NEXT TEST</i> - <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-13 Fri&gt;</span></span></h4>
<div class="outline-text-4" id="text-org362394d">
<p>
By this time, we hope to have a unique mechanism for character speech, and firearms.
</p>
</div>
</div>
<div id="outline-container-orgf9f8258" class="outline-4">
<h4 id="orgf9f8258">First deadline</h4>
<div class="outline-text-4" id="text-orgf9f8258">
<p>
Today a successful technological demonstration of Eclipse was held.
</p>

<p>
In that time, the remainder of our deadlined items were completed &#x2013; all of the features we wanted to implement were implemented and all of the bugs we were tracking were eliminated.
</p>
</div>
</div>
