org/changes.org
*** "Too fancy for your own good."
The bigger pages belonging to user =~corpse= (that includes the one you're reading) now have embeds that can be read by awful things like Discord.
** <2024-09-05 Thu>
*** "How does it taste, mother?!"
Items can now be swung as melee weapons.

It is trivial for us to create new implements by which players can murder other players using simple physics prop-appropriate models, for which there is no need to use a viewmodel.
*** "New blood makes it taste fresher."
For the first time in a long time, we have a new contributor to the code side of things.

Danku-chan, previously already having contributed to the project with her art, sound, and her conceptual mind, has taken the first steps (using Neovim) to create new objects within our game.

She is learning fast and Sotla is very proud of her.
*** "We've got deadlines, fuckface!"
We are becoming more familiar with Org Mode to make use of its agenda features, in order to keep track of what we need to do next, what we want to do, what we need to fix, when we need to do it, and so on.

For the first time in the nightmare's development history, we're scheduling things and setting deadlines. We're writing down bugs and remembering to fix them instead of forgetting them with "I'll do it later".
*** "Wow! I can pick it up and throw it!"
From the old Alchemy stuff again, the ability to manipulate the position of ingame objects returns.
- Simply dropping items makes them fall from your hand. Other gamemodes would spawn the item into thin air in front of your face.
- Placing items is possible by holding the keybind for dropping things and then left clicking someplace.
- Throwing items is possible by doing the same as placing items, but while also holding the right mouse button.
By doing this, you can actually set down an impact bomb without detonating it. It will still be armed and dangerous; take care not to let it roll and fall off of something.
*** "Wait, I can interact with it too?"
Basics of item interaction were implemented.
- Using an item with itself/on yourself: ~MOUSE_MIDDLE~.
- Using an item on something or someone else: click on them with the item in your hand.
*** "Choke on this!"
The first *real* items added to the game: /bombs./

So far these include timed, impact, and incendiary (impact) bombs.

There's lore where the incendiary bomb is concerned, but you can wait a bit longer to see that.
*** "Tastes like sadness."
Food was added next.
- Makes a lovely noise when you eat it.
- Can rot.

Danku-chan made a number of these new ones, as well as some junk items.
*** Technical stuff
Bugs concerning reposition of items when you drop/place them were fixed.

It's no longer necessary to manually require every file manually; entire directories can be specified instead.
*** Reflection
This is all starting to resemble a playable game at a surprisingly
fast rate. The majority of the important things outlined in this
changelog were accomplished in the last few days. Things that seemed
as though they should have taken much longer were wiped out in mere
hours.
* August 2024
** <2024-08-08 Thu>
*** "I forgot to update the changelog."
I'd rather not make an entry for every date so let me just list some additions.
- ~STATUS~
  - Stamina
  - Hunger
  - Thirst
  - Poison
- ~ACT~
  - A system for animated actions, one at a time.
  - Hand to hand combat; hold ~RMB~ to enter combat mode.
    - Punching
    - Kicking
    - Stomping
    - Shoving
    - Hard shoving
  - Press K to kough is an ACT.
- Corpses
  - Make noise as they decay (gurgle munch crunch)
  - Keep their clothing as they decay
- ~STATE~
  - Standing
  - Crouching
  - Crawling
* July 2024
** <2024-07-15 Mon>
*** "God damn it, I thought there were game changes in this one!"
There is now a [[file:lore.html][lore section]] on the [[file:index.html][main page]].
** <2024-07-13 Sat>
*** "He's rotting, you know."
- Corpses now decay over time through five stages:
  - Fresh
  - Bloat
  - Active Decay
  - Advanced Decay
  - Dry Remains
- Corpses which are not dry remains can be cremated.
*** "There was an automated update report for /this/?"
The styling was updated +a little bit+, once again.
** <2024-07-12 Fri>
*** "It's so unlike Source movement! I hate it!"
- Speed is no longer gained in an instant.
  - You must hold down ~SHIFT~ while moving /forward/ in order to gain momentum.
  - As a consequence, when initially beginning to run you might only lightly smack into a wall, not hard enough to knock you over or cause serious damage.
- Speed is also no longer lost in an instant.
  - Letting go of the movement control while moving faster than a walk's pace keeps you moving forward with your momentum.
  - As a consequence, failure to pace yourself can send you into a wall, off of a dangerous height, into other people. If you're lucky it might be even more fun than those things.
- The speed your character targets using ~SHIFT~ is tunable by scrolling the mouse wheel while holding ~SHIFT~.
  - Scrolling the mouse wheel up aims to go faster.
    A noise that plays each scroll of the wheel increases in pitch as your walking becomes running, and as your walking becomes a full sprint.
  - Scrolling the mouse wheel down aims to go slower.
    A noise that plays each scroll of the wheel decreases in pitch as your walking goes into a silent creeping motion.
  - ~SHIFT~ is necessary to move at a slower speed while standing and can be considered a general modifier key for movement speed, instead of just to move faster.
    This way, not pressing ~SHIFT~ always leads you to walk normally.
