org/changes.html
<div id="outline-container-orgea4a149" class="outline-4">
<h4 id="orgea4a149">"Too fancy for your own good."</h4>
<div class="outline-text-4" id="text-orgea4a149">
<p>
The bigger pages belonging to user <code>~corpse</code> (that includes the one you're reading) now have embeds that can be read by awful things like Discord.
</p>
</div>
</div>
</div>
<div id="outline-container-org893d353" class="outline-3">
<h3 id="org893d353"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-05 Thu&gt;</span></span></h3>
<div class="outline-text-3" id="text-org893d353">
</div>
<div id="outline-container-org0296b8d" class="outline-4">
<h4 id="org0296b8d">"How does it taste, mother?!"</h4>
<div class="outline-text-4" id="text-org0296b8d">
<p>
Items can now be swung as melee weapons.
</p>

<p>
It is trivial for us to create new implements by which players can murder other players using simple physics prop-appropriate models, for which there is no need to use a viewmodel.
</p>
</div>
</div>
<div id="outline-container-org6e4ab09" class="outline-4">
<h4 id="org6e4ab09">"New blood makes it taste fresher."</h4>
<div class="outline-text-4" id="text-org6e4ab09">
<p>
For the first time in a long time, we have a new contributor to the code side of things.
</p>

<p>
Danku-chan, previously already having contributed to the project with her art, sound, and her conceptual mind, has taken the first steps (using Neovim) to create new objects within our game.
</p>

<p>
She is learning fast and Sotla is very proud of her.
</p>
</div>
</div>
<div id="outline-container-orgc6d06d5" class="outline-4">
<h4 id="orgc6d06d5">"We've got deadlines, fuckface!"</h4>
<div class="outline-text-4" id="text-orgc6d06d5">
<p>
We are becoming more familiar with Org Mode to make use of its agenda features, in order to keep track of what we need to do next, what we want to do, what we need to fix, when we need to do it, and so on.
</p>

<p>
For the first time in the nightmare's development history, we're scheduling things and setting deadlines. We're writing down bugs and remembering to fix them instead of forgetting them with "I'll do it later".
</p>
</div>
</div>
<div id="outline-container-org978be46" class="outline-4">
<h4 id="org978be46">"Wow! I can pick it up and throw it!"</h4>
<div class="outline-text-4" id="text-org978be46">
<p>
From the old Alchemy stuff again, the ability to manipulate the position of ingame objects returns.
</p>
<ul class="org-ul">
<li>Simply dropping items makes them fall from your hand. Other gamemodes would spawn the item into thin air in front of your face.</li>
<li>Placing items is possible by holding the keybind for dropping things and then left clicking someplace.</li>
<li>Throwing items is possible by doing the same as placing items, but while also holding the right mouse button.</li>
</ul>
<p>
By doing this, you can actually set down an impact bomb without detonating it. It will still be armed and dangerous; take care not to let it roll and fall off of something.
</p>
</div>
</div>
<div id="outline-container-org79ab72c" class="outline-4">
<h4 id="org79ab72c">"Wait, I can interact with it too?"</h4>
<div class="outline-text-4" id="text-org79ab72c">
<p>
Basics of item interaction were implemented.
</p>
<ul class="org-ul">
<li>Using an item with itself/on yourself: <code>MOUSE_MIDDLE</code>.</li>
<li>Using an item on something or someone else: click on them with the item in your hand.</li>
</ul>
</div>
</div>
<div id="outline-container-orga4f5c46" class="outline-4">
<h4 id="orga4f5c46">"Choke on this!"</h4>
<div class="outline-text-4" id="text-orga4f5c46">
<p>
The first <b>real</b> items added to the game: <i>bombs.</i>
</p>

<p>
So far these include timed, impact, and incendiary (impact) bombs.
</p>

<p>
There's lore where the incendiary bomb is concerned, but you can wait a bit longer to see that.
</p>
</div>
</div>
<div id="outline-container-org147d999" class="outline-4">
<h4 id="org147d999">"Tastes like sadness."</h4>
<div class="outline-text-4" id="text-org147d999">
<p>
Food was added next.
</p>
<ul class="org-ul">
<li>Makes a lovely noise when you eat it.</li>
<li>Can rot.</li>
</ul>

<p>
Danku-chan made a number of these new ones, as well as some junk items.
</p>
</div>
</div>
<div id="outline-container-org65bf96a" class="outline-4">
<h4 id="org65bf96a">Technical stuff</h4>
<div class="outline-text-4" id="text-org65bf96a">
<p>
Bugs concerning reposition of items when you drop/place them were fixed.
</p>

<p>
It's no longer necessary to manually require every file manually; entire directories can be specified instead.
</p>
</div>
</div>
<div id="outline-container-org80bfc3f" class="outline-4">
<h4 id="org80bfc3f">Reflection</h4>
<div class="outline-text-4" id="text-org80bfc3f">
<p>
This is all starting to resemble a playable game at a surprisingly
fast rate. The majority of the important things outlined in this
changelog were accomplished in the last few days. Things that seemed
as though they should have taken much longer were wiped out in mere
hours.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org4aac2fa" class="outline-2">
<h2 id="org4aac2fa">August 2024</h2>
<div class="outline-text-2" id="text-org4aac2fa">
</div>
<div id="outline-container-orgc543336" class="outline-3">
<h3 id="orgc543336"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-08-08 Thu&gt;</span></span></h3>
<div class="outline-text-3" id="text-orgc543336">
</div>
<div id="outline-container-org0201585" class="outline-4">
<h4 id="org0201585">"I forgot to update the changelog."</h4>
<div class="outline-text-4" id="text-org0201585">
<p>
I'd rather not make an entry for every date so let me just list some additions.
</p>
<ul class="org-ul">
<li><code>STATUS</code>
<ul class="org-ul">
<li>Stamina</li>
<li>Hunger</li>
<li>Thirst</li>
<li>Poison</li>
</ul></li>
<li><code>ACT</code>
<ul class="org-ul">
<li>A system for animated actions, one at a time.</li>
<li>Hand to hand combat; hold <code>RMB</code> to enter combat mode.
<ul class="org-ul">
<li>Punching</li>
<li>Kicking</li>
<li>Stomping</li>
<li>Shoving</li>
<li>Hard shoving</li>
</ul></li>
<li>Press K to kough is an ACT.</li>
</ul></li>
<li>Corpses
<ul class="org-ul">
<li>Make noise as they decay (gurgle munch crunch)</li>
<li>Keep their clothing as they decay</li>
</ul></li>
<li><code>STATE</code>
<ul class="org-ul">
<li>Standing</li>
<li>Crouching</li>
<li>Crawling</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org7be668d" class="outline-2">
<h2 id="org7be668d">July 2024</h2>
<div class="outline-text-2" id="text-org7be668d">
</div>
<div id="outline-container-org0b27777" class="outline-3">
<h3 id="org0b27777"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-15 Mon&gt;</span></span></h3>
<div class="outline-text-3" id="text-org0b27777">
</div>
<div id="outline-container-orgf8bf4a3" class="outline-4">
<h4 id="orgf8bf4a3">"God damn it, I thought there were game changes in this one!"</h4>
<div class="outline-text-4" id="text-orgf8bf4a3">
<p>
There is now a <a href="lore.html">lore section</a> on the <a href="index.html">main page</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org02238a8" class="outline-3">
<h3 id="org02238a8"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-13 Sat&gt;</span></span></h3>
<div class="outline-text-3" id="text-org02238a8">
</div>
<div id="outline-container-org1c50707" class="outline-4">
<h4 id="org1c50707">"He's rotting, you know."</h4>
<div class="outline-text-4" id="text-org1c50707">
<ul class="org-ul">
<li>Corpses now decay over time through five stages:
<ul class="org-ul">
<li>Fresh</li>
<li>Bloat</li>
<li>Active Decay</li>
<li>Advanced Decay</li>
<li>Dry Remains</li>
</ul></li>
<li>Corpses which are not dry remains can be cremated.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd01def0" class="outline-4">
<h4 id="orgd01def0">"There was an automated update report for <i>this</i>?"</h4>
<div class="outline-text-4" id="text-orgd01def0">
<p>
The styling was updated <del>a little bit</del>, once again.
</p>
</div>
</div>
</div>
<div id="outline-container-org9df8454" class="outline-3">
<h3 id="org9df8454"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-12 Fri&gt;</span></span></h3>
<div class="outline-text-3" id="text-org9df8454">
</div>
<div id="outline-container-orgd75afed" class="outline-4">
<h4 id="orgd75afed">"It's so unlike Source movement! I hate it!"</h4>
<div class="outline-text-4" id="text-orgd75afed">
<ul class="org-ul">
<li>Speed is no longer gained in an instant.
<ul class="org-ul">
<li>You must hold down <code>SHIFT</code> while moving <i>forward</i> in order to gain momentum.</li>
<li>As a consequence, when initially beginning to run you might only lightly smack into a wall, not hard enough to knock you over or cause serious damage.</li>
</ul></li>
<li>Speed is also no longer lost in an instant.
<ul class="org-ul">
<li>Letting go of the movement control while moving faster than a walk's pace keeps you moving forward with your momentum.</li>
<li>As a consequence, failure to pace yourself can send you into a wall, off of a dangerous height, into other people. If you're lucky it might be even more fun than those things.</li>
</ul></li>
<li>The speed your character targets using <code>SHIFT</code> is tunable by scrolling the mouse wheel while holding <code>SHIFT</code>.
<ul class="org-ul">
<li>Scrolling the mouse wheel up aims to go faster.
A noise that plays each scroll of the wheel increases in pitch as your walking becomes running, and as your walking becomes a full sprint.</li>
<li>Scrolling the mouse wheel down aims to go slower.
A noise that plays each scroll of the wheel decreases in pitch as your walking goes into a silent creeping motion.</li>
<li><code>SHIFT</code> is necessary to move at a slower speed while standing and can be considered a general modifier key for movement speed, instead of just to move faster.
This way, not pressing <code>SHIFT</code> always leads you to walk normally.</li>
</ul></li>
</ul>
</div>
</div>
