org/changes.org
*** "Wow, that looks much nicer."
Not technically related to the game, but to this very changelog itself and all pages under [[https://death.town/~corpse][~corpse]].
- Correctly stored theme which should work regardless of ~http~ or ~https~.
- +Table of contents.+ Not anymore. There's a banner now, though.
- Omission of things like /authors/ and /timestamps/. Who needs all that?
- No more sequential numbering of items.
- New format grouping various 'articles' under the dates of destiny.

If you're any good at CSS* and would like to offer improvements to the style of these pages, please let us know.

*Not Counter-Strike Source.
*** "Ow, the consequences of my actions!"
- Our favorite feature makes a swift return; running into things hurts you.
  - Running into things fast enough knocks you over.
  - You can run into other people to knock them over.
- ~SOUND~ was ported from ~class-war~.
  - Defining sound scripts is now way easier.
  - Sounds declared this way will only need to be altered once to apply across the whole game.
  - This is the sort of dead simple convenience we neglected on the old game that made it become intolerable to continue working on it.
*** Sotla
~sotla.sh~ was written to automatically report when this file changes and is pushed to the server.
** <2024-07-10 Wed>
*** Corpse Collection
- Death no longer produces fake clientside-only ragdolls, but serverside ragdolls with proper collisions and behaviors.
- Damage to ragdolls is now applied to the players to whom the ragdolls belong, and ragdolls are now detached from a player when they respawn.
- Tumbling into other ragdolls is now less lethal. While this does technically make the game easier, it's far less broken this way.
*** Binding, Bodies
- ~BIND~ was ported from ~class-war~ and its first use case was in making ~KEY_T~ cause the player to tumble over when pressed.
- The first person camera now respects the entity considered to be the player's body, which is the ~Player~ itself if it does not have a ragdoll, or the ragdoll in question if it does.
** <2024-07-09 Tue>
*** Transmutation
- The first person view camera and crosshair from Alchemy was ported into Eclipse.
- ~PLYCLASS~ was created to make player class definition easier and more organized.
** <2024-07-06 Sat>
*** Beginning
- Eclipse is born. Again.
- A class ~MODULE~ is created in order to make organization and definition of hooks and other game behavior a lot easier for us.
