org/changes.html
<div id="outline-container-orgad0313e" class="outline-4">
<h4 id="orgad0313e">"Wow, that looks much nicer."</h4>
<div class="outline-text-4" id="text-orgad0313e">
<p>
Not technically related to the game, but to this very changelog itself and all pages under <a href="https://death.town/~corpse">~corpse</a>.
</p>
<ul class="org-ul">
<li>Correctly stored theme which should work regardless of <code>http</code> or <code>https</code>.</li>
<li><del>Table of contents.</del> Not anymore. There's a banner now, though.</li>
<li>Omission of things like <i>authors</i> and <i>timestamps</i>. Who needs all that?</li>
<li>No more sequential numbering of items.</li>
<li>New format grouping various 'articles' under the dates of destiny.</li>
</ul>

<p>
If you're any good at CSS* and would like to offer improvements to the style of these pages, please let us know.
</p>

<p>
*Not Counter-Strike Source.
</p>
</div>
</div>
<div id="outline-container-org874d028" class="outline-4">
<h4 id="org874d028">"Ow, the consequences of my actions!"</h4>
<div class="outline-text-4" id="text-org874d028">
<ul class="org-ul">
<li>Our favorite feature makes a swift return; running into things hurts you.
<ul class="org-ul">
<li>Running into things fast enough knocks you over.</li>
<li>You can run into other people to knock them over.</li>
</ul></li>
<li><code>SOUND</code> was ported from <code>class-war</code>.
<ul class="org-ul">
<li>Defining sound scripts is now way easier.</li>
<li>Sounds declared this way will only need to be altered once to apply across the whole game.</li>
<li>This is the sort of dead simple convenience we neglected on the old game that made it become intolerable to continue working on it.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf1fb1be" class="outline-4">
<h4 id="orgf1fb1be">Sotla</h4>
<div class="outline-text-4" id="text-orgf1fb1be">
<p>
<code>sotla.sh</code> was written to automatically report when this file changes and is pushed to the server.
</p>
</div>
</div>
</div>
<div id="outline-container-org9f952ab" class="outline-3">
<h3 id="org9f952ab"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-10 Wed&gt;</span></span></h3>
<div class="outline-text-3" id="text-org9f952ab">
</div>
<div id="outline-container-org37524e1" class="outline-4">
<h4 id="org37524e1">Corpse Collection</h4>
<div class="outline-text-4" id="text-org37524e1">
<ul class="org-ul">
<li>Death no longer produces fake clientside-only ragdolls, but serverside ragdolls with proper collisions and behaviors.</li>
<li>Damage to ragdolls is now applied to the players to whom the ragdolls belong, and ragdolls are now detached from a player when they respawn.</li>
<li>Tumbling into other ragdolls is now less lethal. While this does technically make the game easier, it's far less broken this way.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd57970b" class="outline-4">
<h4 id="orgd57970b">Binding, Bodies</h4>
<div class="outline-text-4" id="text-orgd57970b">
<ul class="org-ul">
<li><code>BIND</code> was ported from <code>class-war</code> and its first use case was in making <code>KEY_T</code> cause the player to tumble over when pressed.</li>
<li>The first person camera now respects the entity considered to be the player's body, which is the <code>Player</code> itself if it does not have a ragdoll, or the ragdoll in question if it does.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2f7e4f8" class="outline-3">
<h3 id="org2f7e4f8"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-09 Tue&gt;</span></span></h3>
<div class="outline-text-3" id="text-org2f7e4f8">
</div>
<div id="outline-container-org7e21f19" class="outline-4">
<h4 id="org7e21f19">Transmutation</h4>
<div class="outline-text-4" id="text-org7e21f19">
<ul class="org-ul">
<li>The first person view camera and crosshair from Alchemy was ported into Eclipse.</li>
<li><code>PLYCLASS</code> was created to make player class definition easier and more organized.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2c567d6" class="outline-3">
<h3 id="org2c567d6"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-06 Sat&gt;</span></span></h3>
<div class="outline-text-3" id="text-org2c567d6">
</div>
<div id="outline-container-org2add11c" class="outline-4">
<h4 id="org2add11c">Beginning</h4>
<div class="outline-text-4" id="text-org2add11c">
<ul class="org-ul">
<li>Eclipse is born. Again.</li>
<li>A class <code>MODULE</code> is created in order to make organization and definition of hooks and other game behavior a lot easier for us.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
